; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))

  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (and (calibrated ?i)))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (and (have_image ?d ?m))))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	satellite4 - satellite
	instrument7 - instrument
	instrument8 - instrument
	instrument9 - instrument
	thermograph2 - mode
	thermograph1 - mode
	image0 - mode
	infrared3 - mode
	GroundStation0 - direction
	GroundStation1 - direction
	GroundStation2 - direction
	Planet3 - direction
	Planet4 - direction
	Planet5 - direction
	Star6 - direction
	Phenomenon7 - direction
	Phenomenon8 - direction
	Planet9 - direction
	Star10 - direction
	Planet11 - direction
	Phenomenon12 - direction
	Phenomenon13 - direction
	Planet14 - direction
	Planet15 - direction
	Star16 - direction
	Planet17 - direction
	Phenomenon18 - direction
	Planet19 - direction
	Star20 - direction
	Planet21 - direction
	Planet22 - direction
	Star23 - direction
	Planet24 - direction
	Phenomenon25 - direction
)
(:init
	(supports instrument0 image0)
	(supports instrument0 infrared3)
	(calibration_target instrument0 GroundStation0)
	(supports instrument1 thermograph1)
	(supports instrument1 image0)
	(calibration_target instrument1 GroundStation1)
	(supports instrument2 image0)
	(supports instrument2 thermograph1)
	(supports instrument2 thermograph2)
	(calibration_target instrument2 GroundStation2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet17)
	(supports instrument3 thermograph2)
	(calibration_target instrument3 GroundStation1)
	(supports instrument4 thermograph1)
	(calibration_target instrument4 GroundStation1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet4)
	(supports instrument5 image0)
	(calibration_target instrument5 GroundStation0)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet9)
	(supports instrument6 thermograph1)
	(calibration_target instrument6 GroundStation1)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star23)
	(supports instrument7 thermograph1)
	(calibration_target instrument7 GroundStation1)
	(supports instrument8 infrared3)
	(supports instrument8 image0)
	(calibration_target instrument8 GroundStation2)
	(supports instrument9 infrared3)
	(supports instrument9 image0)
	(calibration_target instrument9 GroundStation2)
	(on_board instrument7 satellite4)
	(on_board instrument8 satellite4)
	(on_board instrument9 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Phenomenon18)
)
(:goal (and
	(pointing satellite0 Phenomenon7)
	(pointing satellite1 Star20)
	(pointing satellite3 Phenomenon25)
	(have_image Planet3 thermograph2)
	(have_image Planet4 infrared3)
	(have_image Planet5 infrared3)
	(have_image Star6 thermograph1)
	(have_image Phenomenon7 infrared3)
	(have_image Planet9 image0)
	(have_image Star10 thermograph2)
	(have_image Planet11 infrared3)
	(have_image Phenomenon12 infrared3)
	(have_image Phenomenon13 thermograph1)
	(have_image Planet14 infrared3)
	(have_image Planet15 thermograph2)
	(have_image Planet17 thermograph2)
	(have_image Phenomenon18 infrared3)
	(have_image Planet19 infrared3)
	(have_image Star20 infrared3)
	(have_image Planet21 thermograph2)
	(have_image Planet22 image0)
	(have_image Star23 infrared3)
	(have_image Planet24 image0)
	(have_image Phenomenon25 infrared3)
))

)

; plan
1. (switch_on instrument7 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument7)
   goals met: 0 of 24
2. (switch_on instrument5 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument5)
   goals met: 0 of 24
3. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 24
4. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 24
5. (turn_to satellite4 groundstation1 phenomenon18)
   deleted: (pointing satellite4 phenomenon18)
   added: (pointing satellite4 groundstation1)
   goals met: 0 of 24
6. (calibrate satellite4 instrument7 groundstation1)
   added: (calibrated instrument7)
   goals met: 0 of 24
7. (turn_to satellite4 phenomenon13 groundstation1)
   deleted: (pointing satellite4 groundstation1)
   added: (pointing satellite4 phenomenon13)
   goals met: 0 of 24
8. (take_image satellite4 phenomenon13 instrument7 thermograph1)
   added: (have_image phenomenon13 thermograph1)
   goals met: 1 of 24
9. (turn_to satellite4 star6 phenomenon13)
   deleted: (pointing satellite4 phenomenon13)
   added: (pointing satellite4 star6)
   goals met: 1 of 24
10. (take_image satellite4 star6 instrument7 thermograph1)
   added: (have_image star6 thermograph1)
   goals met: 2 of 24
11. (turn_to satellite3 phenomenon25 star23)
   deleted: (pointing satellite3 star23)
   added: (pointing satellite3 phenomenon25)
   goals met: 3 of 24
12. (turn_to satellite2 groundstation0 planet9)
   deleted: (pointing satellite2 planet9)
   added: (pointing satellite2 groundstation0)
   goals met: 3 of 24
13. (calibrate satellite2 instrument5 groundstation0)
   added: (calibrated instrument5)
   goals met: 3 of 24
14. (turn_to satellite2 planet22 groundstation0)
   deleted: (pointing satellite2 groundstation0)
   added: (pointing satellite2 planet22)
   goals met: 3 of 24
15. (take_image satellite2 planet22 instrument5 image0)
   added: (have_image planet22 image0)
   goals met: 4 of 24
16. (turn_to satellite2 planet24 planet22)
   deleted: (pointing satellite2 planet22)
   added: (pointing satellite2 planet24)
   goals met: 4 of 24
17. (take_image satellite2 planet24 instrument5 image0)
   added: (have_image planet24 image0)
   goals met: 5 of 24
18. (turn_to satellite2 planet9 planet24)
   deleted: (pointing satellite2 planet24)
   added: (pointing satellite2 planet9)
   goals met: 5 of 24
19. (take_image satellite2 planet9 instrument5 image0)
   added: (have_image planet9 image0)
   goals met: 6 of 24
20. (turn_to satellite1 groundstation1 planet4)
   deleted: (pointing satellite1 planet4)
   added: (pointing satellite1 groundstation1)
   goals met: 6 of 24
21. (calibrate satellite1 instrument3 groundstation1)
   added: (calibrated instrument3)
   goals met: 6 of 24
22. (turn_to satellite1 planet15 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 planet15)
   goals met: 6 of 24
23. (take_image satellite1 planet15 instrument3 thermograph2)
   added: (have_image planet15 thermograph2)
   goals met: 7 of 24
24. (turn_to satellite1 planet17 planet15)
   deleted: (pointing satellite1 planet15)
   added: (pointing satellite1 planet17)
   goals met: 7 of 24
25. (take_image satellite1 planet17 instrument3 thermograph2)
   added: (have_image planet17 thermograph2)
   goals met: 8 of 24
26. (turn_to satellite1 planet21 planet17)
   deleted: (pointing satellite1 planet17)
   added: (pointing satellite1 planet21)
   goals met: 8 of 24
27. (take_image satellite1 planet21 instrument3 thermograph2)
   added: (have_image planet21 thermograph2)
   goals met: 9 of 24
28. (turn_to satellite1 planet3 planet21)
   deleted: (pointing satellite1 planet21)
   added: (pointing satellite1 planet3)
   goals met: 9 of 24
29. (take_image satellite1 planet3 instrument3 thermograph2)
   added: (have_image planet3 thermograph2)
   goals met: 10 of 24
30. (turn_to satellite1 star10 planet3)
   deleted: (pointing satellite1 planet3)
   added: (pointing satellite1 star10)
   goals met: 10 of 24
31. (take_image satellite1 star10 instrument3 thermograph2)
   added: (have_image star10 thermograph2)
   goals met: 11 of 24
32. (turn_to satellite1 star20 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 star20)
   goals met: 12 of 24
33. (turn_to satellite0 groundstation0 planet17)
   deleted: (pointing satellite0 planet17)
   added: (pointing satellite0 groundstation0)
   goals met: 12 of 24
34. (calibrate satellite0 instrument0 groundstation0)
   added: (calibrated instrument0)
   goals met: 12 of 24
35. (turn_to satellite0 phenomenon12 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 phenomenon12)
   goals met: 12 of 24
36. (take_image satellite0 phenomenon12 instrument0 infrared3)
   added: (have_image phenomenon12 infrared3)
   goals met: 13 of 24
37. (turn_to satellite0 phenomenon18 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 phenomenon18)
   goals met: 13 of 24
38. (take_image satellite0 phenomenon18 instrument0 infrared3)
   added: (have_image phenomenon18 infrared3)
   goals met: 14 of 24
39. (turn_to satellite0 phenomenon25 phenomenon18)
   deleted: (pointing satellite0 phenomenon18)
   added: (pointing satellite0 phenomenon25)
   goals met: 14 of 24
40. (take_image satellite0 phenomenon25 instrument0 infrared3)
   added: (have_image phenomenon25 infrared3)
   goals met: 15 of 24
41. (turn_to satellite0 phenomenon7 phenomenon25)
   deleted: (pointing satellite0 phenomenon25)
   added: (pointing satellite0 phenomenon7)
   goals met: 16 of 24
42. (take_image satellite0 phenomenon7 instrument0 infrared3)
   added: (have_image phenomenon7 infrared3)
   goals met: 17 of 24
43. (turn_to satellite0 planet11 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 planet11)
   goals met: 16 of 24
44. (take_image satellite0 planet11 instrument0 infrared3)
   added: (have_image planet11 infrared3)
   goals met: 17 of 24
45. (turn_to satellite0 phenomenon7 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 phenomenon7)
   goals met: 18 of 24
46. (turn_to satellite0 planet14 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 planet14)
   goals met: 17 of 24
47. (take_image satellite0 planet14 instrument0 infrared3)
   added: (have_image planet14 infrared3)
   goals met: 18 of 24
48. (turn_to satellite0 phenomenon7 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 phenomenon7)
   goals met: 19 of 24
49. (turn_to satellite0 planet19 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 planet19)
   goals met: 18 of 24
50. (take_image satellite0 planet19 instrument0 infrared3)
   added: (have_image planet19 infrared3)
   goals met: 19 of 24
51. (turn_to satellite0 phenomenon7 planet19)
   deleted: (pointing satellite0 planet19)
   added: (pointing satellite0 phenomenon7)
   goals met: 20 of 24
52. (turn_to satellite0 planet4 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 planet4)
   goals met: 19 of 24
53. (take_image satellite0 planet4 instrument0 infrared3)
   added: (have_image planet4 infrared3)
   goals met: 20 of 24
54. (turn_to satellite0 phenomenon7 planet4)
   deleted: (pointing satellite0 planet4)
   added: (pointing satellite0 phenomenon7)
   goals met: 21 of 24
55. (turn_to satellite0 planet5 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 planet5)
   goals met: 20 of 24
56. (take_image satellite0 planet5 instrument0 infrared3)
   added: (have_image planet5 infrared3)
   goals met: 21 of 24
57. (turn_to satellite0 phenomenon7 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 phenomenon7)
   goals met: 22 of 24
58. (turn_to satellite0 star20 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 star20)
   goals met: 21 of 24
59. (take_image satellite0 star20 instrument0 infrared3)
   added: (have_image star20 infrared3)
   goals met: 22 of 24
60. (turn_to satellite0 phenomenon7 star20)
   deleted: (pointing satellite0 star20)
   added: (pointing satellite0 phenomenon7)
   goals met: 23 of 24
61. (turn_to satellite0 star23 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 star23)
   goals met: 22 of 24
62. (take_image satellite0 star23 instrument0 infrared3)
   added: (have_image star23 infrared3)
   goals met: 23 of 24
63. (turn_to satellite0 phenomenon7 star23)
   deleted: (pointing satellite0 star23)
   added: (pointing satellite0 phenomenon7)
   goals met: 24 of 24
